{"config": [{"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "use_bias": true, "batch_input_shape": [null, 1, 28, 28], "bias_regularizer": null, "trainable": true, "data_format": "channels_first", "kernel_regularizer": null, "filters": 20, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "name": "conv2d_9", "activation": "linear", "strides": [1, 1], "padding": "same", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_9", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_first", "kernel_regularizer": null, "filters": 50, "bias_constraint": null, "trainable": true, "name": "conv2d_10", "activation": "linear", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_10", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_9", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "units": 500}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_10", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "units": 10}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "softmax"}}], "backend": "theano", "keras_version": "2.0.2", "class_name": "Sequential"}